[
    {
      "imgSrc": "images/SS1.webp",
      "title": "Šta je Speak&Spell?",
      "text": "Škola Speak&Spell je u septembru 2016. godine otvorila vrata sve djecu svih uzrasta koja žele da steknu napredno znanje iz engleskog jezika. Od samog početka, nudimo kvalitetne obuke djece, unaprjeđujući školsko gradivo i obogaćujući ga radionicama koje uključuju igre i kreativno razmišljanje. Od 2017. godine, naša škola nudi i kurseve na još 3 jezika. Polaznicima znanje prenosi probrani kadar sa dugogodišnjim iskustvom, kako u oblasti lingvistike, tako i u radu sa djecom. Budući da škola Speak&Spell širi svoje djelovanje uvođenjem novih kurseva i programa, nastojimo da oko sebe okupimo stručnjake koji će svoja znanja i vještine prenijeti našim polaznicama i polaznicima. Naše polaznice i polaznike učimo znanju koje će ih učiniti sposobnim da se snađu ne samo u školi, već i bilo gdje u svijetu. U tom pogledu, balans kvalitetnog gradiva sa zanimljivim metodama učenja predstavlja dobitnu kombinaciju. Sa ciljem da polaznicima obezbijedimo taj neophodan momenat interakcije sa predavačima, organizujemo i kreativne radionice i “native speaking” časove putem kojih naši polaznici imaju priliku da praktično primijene naučeno."
    },
    {
      "imgSrc": "images/SS2.jpg",
      "title": "Misija i vizija",
      "text": "Misija škole Speak&Spell je da kroz akreditovane programe na lak način približi polaznicima gradivo stranih jezika. Vizija škole Speak&Spell je da budemo prepoznati kao vodeća privatna obrazovna institucija u Crnoj Gori kada je u pitanju obrazovanje djece nižeg uzrasta. Vrijednosti koje dijelimo proističu iz kulture organizacije, definišu našu zajednicu koju čine polaznice i polaznici, predavači i zaposleni. Misija i vizija škole Speak&Spell se naslanjaju na naše vrijednosti, a to su: znanje, kreativnost i intelekt."
    },
    {
      "imgSrc": "images/SS3.jpg",
      "title": "O Speak&Spell",
      "text": "Mi smo posvećeni tim profesora koji uživaju u dinamičnom i kreativnom obučavanju djece, gdje imamo mogućnost da stalno susrećemo nove izazove. Ponosni smo na naše uspjehe koji se vide kroz znanje naših polaznika i zadovoljstvo njihovih roditelja. Imperativ svake obrazovne ustanove u savremenom poslovanju treba da bude znanje koje pruža mladima. Speak&Spell ide korak dalje i nastoji da poboljša i kreativnost i kognitivne procese djece koja nam dolaze. Volimo da svakom đaku pristupimo na jedinstven način. Izdvajamo vrijeme da razumijemo njihovo razmišljanje i približimo im gradivo na kvalitetan način."
    }
  ]
  